api/models/AuthForm.php

INSERT INTO `token` (`user_id`, `expired_at`, `token`) VALUES (1, 1552950196, 'f0EilFQc5WyZTc_ao5EOfWt1M6nmQHlO')
---
    public function auth() : ?Token
    {
		if (!$this->validate())
			return null;

		$token = new Token();
		$token->user_id = $this->getUser()->id;
		$token->generateToken(time() + 3600 * 24);
		return $token->save() ? $token : null;